import random
import projeto_arquivos

# LOGOS

def logo():
    print(150 * '/')
    print(r'''                                                                                                                        
 ▄▄▄▄▄▄▄▄                                             ▄▄▄▄                 ▄█▀                ██                        
 ██▀▀▀▀▀▀                                           ██▀▀▀▀█               ▀▀       ██         ▀▀                        
 ██         ██▄████   ██▄████   ▄████▄             ██▀        ██▄████   ████     ███████    ████      ▄█████▄   ▄████▄  
 ███████    ██▀       ██▀      ██▀  ▀██            ██         ██▀         ██       ██         ██     ██▀    ▀  ██▀  ▀██ 
 ██         ██        ██       ██    ██            ██▄        ██          ██       ██         ██     ██        ██    ██ 
 ██▄▄▄▄▄▄   ██        ██       ▀██▄▄██▀             ██▄▄▄▄█   ██       ▄▄▄██▄▄▄    ██▄▄▄   ▄▄▄██▄▄▄  ▀██▄▄▄▄█  ▀██▄▄██▀ 
 ▀▀▀▀▀▀▀▀   ▀▀        ▀▀         ▀▀▀▀                 ▀▀▀▀    ▀▀       ▀▀▀▀▀▀▀▀     ▀▀▀▀   ▀▀▀▀▀▀▀▀    ▀▀▀▀▀     ▀▀▀▀   
                                                                                                                        
                                                                                                                        ''')
    print(150 * '/')

def logo_cap01():
    print(r'''
                                ▄▀                                                  
 ▄▄▄▄▄▄▄  ▄▄▄▄▄▄▄ ▄▄▄    ▄▄▄   ▄▄▄▄   ▄▄▄▄▄▄▄   ▄▄▄▄▄   ▄▄▄▄▄         ▄▄▄▄     ▄▄▄▄ 
███▀▀▀▀▀ ███▀▀▀▀▀ ████▄  ███ ▄██▀▀██▄ ███▀▀███▄  ███  ▄███████▄     ▄██████▄ ▄█████ 
███      ███▄▄    ███▀██▄███ ███  ███ ███▄▄███▀  ███  ███   ███     ███  ███    ███ 
███      ███      ███  ▀████ ███▀▀███ ███▀▀██▄   ███  ███▄▄▄███     ███▄▄███    ███ 
▀███████ ▀███████ ███    ███ ███  ███ ███  ▀███ ▄███▄  ▀█████▀       ▀████▀     ███ 
''')

def logo_cap02():
    print(r'''  
                                ▄▀                                                    
 ▄▄▄▄▄▄▄  ▄▄▄▄▄▄▄ ▄▄▄    ▄▄▄   ▄▄▄▄   ▄▄▄▄▄▄▄   ▄▄▄▄▄   ▄▄▄▄▄         ▄▄▄▄   ▄▄▄▄▄▄▄  
███▀▀▀▀▀ ███▀▀▀▀▀ ████▄  ███ ▄██▀▀██▄ ███▀▀███▄  ███  ▄███████▄     ▄██████▄ ▀▀▀▀████ 
███      ███▄▄    ███▀██▄███ ███  ███ ███▄▄███▀  ███  ███   ███     ███  ███    ▄██▀  
███      ███      ███  ▀████ ███▀▀███ ███▀▀██▄   ███  ███▄▄▄███     ███▄▄███  ▄███▄▄▄ 
▀███████ ▀███████ ███    ███ ███  ███ ███  ▀███ ▄███▄  ▀█████▀       ▀████▀  ████████ 
''')

def logo_cap03():
    print(r'''
                                ▄▀                                                    
 ▄▄▄▄▄▄▄  ▄▄▄▄▄▄▄ ▄▄▄    ▄▄▄   ▄▄▄▄   ▄▄▄▄▄▄▄   ▄▄▄▄▄   ▄▄▄▄▄         ▄▄▄▄   ▄▄▄▄▄▄▄  
███▀▀▀▀▀ ███▀▀▀▀▀ ████▄  ███ ▄██▀▀██▄ ███▀▀███▄  ███  ▄███████▄     ▄██████▄ ▀▀▀▀████ 
███      ███▄▄    ███▀██▄███ ███  ███ ███▄▄███▀  ███  ███   ███     ███  ███   ▄▄██▀  
███      ███      ███  ▀████ ███▀▀███ ███▀▀██▄   ███  ███▄▄▄███     ███▄▄███     ███▄ 
▀███████ ▀███████ ███    ███ ███  ███ ███  ▀███ ▄███▄  ▀█████▀       ▀████▀  ███████▀ 
''')

def saiu_do_jogo(nome_char):
    print(f'{nome_char} escolheu abandonar sua aventura...')
    projeto_arquivos.salvar(f'{nome_char} escolheu abandonar sua aventura...\n')

def fim_de_jogo():
    print(r'''                                                                                                  
                                                                                                                            
 ▄████  ▄████▄ ██▄  ▄██ ██████   ▄████▄ ██  ██ ██████ █████▄  
██  ▄▄▄ ██▄▄██ ██ ▀▀ ██ ██▄▄     ██  ██ ██▄▄██ ██▄▄   ██▄▄██▄ 
 ▀███▀  ██  ██ ██    ██ ██▄▄▄▄   ▀████▀  ▀██▀  ██▄▄▄▄ ██   ██ 
                                                              ''')
    projeto_arquivos.salvar(f'GAME OVER\n')
    projeto_arquivos.salvar(f'{100 * '_'}\n\n')
    exit()

# DADOS E SEUS CENÁRIOS

def dados_cen1():

    resultado_dado = random.randint(1, 100)
    print(f'Na abordagem ao animal, o resultado foi: {resultado_dado}/100')

    if resultado_dado >= 30:
        return True
    else:
        return False

def dados_cen2():

    resultado_dado = random.randint(1, 100)
    print(f'Ao tentar agir em relação a ponte, o resultado foi: {resultado_dado}/100')

    if resultado_dado >= 30:
        return True
    else:
        return False

def dados_cen2_machucado():
    resultado_dado = random.randint(1, 100)
    print(f'Apesar de estar machucado(a) , o resultado foi: {resultado_dado}/100')

    if resultado_dado >= 65:
        return True
    else:
        return False

def dados_cen3D():

    resultado_dado = random.randint(1, 100)
    print(f'Ao tentar agir em relação ao goblim, o resultado foi: {resultado_dado}/100')

    if resultado_dado >= 50:
        return True
    else:
        return False





